
&НаСервереБезКонтекста
Функция ДанныеПользователяИБ(Пользователь)

	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Пользователь.ИдентификаторПользователяИБ);	
	Возврат Новый Структура("ПользователяНет, СтандартАут, СохраненыйПароль, ИмяПользователя, ИдентификаторПользователяИБ",
	ПользовательИБ = Неопределено, ПользовательИБ.АутентификацияСтандартная, ПользовательИБ.СохраняемоеЗначениеПароля,ПользовательИБ.Имя, Пользователь.ИдентификаторПользователяИБ);	

КонецФункции

&НаСервереБезКонтекста
Процедура ОбновитьПарольПользователя(Параметры) экспорт
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Параметры.ИдентификаторПользователяИБ);
	ПользовательИБ.СохраняемоеЗначениеПароля = Параметры.СохраненыйПароль;
	ПользовательИБ.АутентификацияСтандартная = Параметры.СтандартАут;
	ПользовательИБ.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПароль() Экспорт

	ОбновитьПарольПользователя(ДанныеПользователя);

КонецПроцедуры
   
&НаКлиенте
Процедура ЗапуститьПодПользователем(Команда)
	
	ДанныеПользователя = ДанныеПользователяИБ(Пользователь);
	Если ДанныеПользователя.ПользователяНет Тогда
		
		Сообщить(НСтр("ru = 'Нет указанного пользователя информационной базы'"));	
	
	КонецЕсли; 	
	СтрокаПараметров = "ENTERPRISE /RunModeManagedApplication " + СтрокаСоединенияИнформационнойБазы() + " /N""" + ДанныеПользователя.ИмяПользователя +  """ /P""123""" ;	
	ОбновитьПарольПользователя(Новый Структура("ИдентификаторПользователяИБ, СохраненыйПароль, СтандартАут",
												ДанныеПользователя.ИдентификаторПользователяИБ, "QL0AFWMIX8NRZTKeof9cXsvbvu8=,QL0AFWMIX8NRZTKeof9cXsvbvu8=", Истина));		
	ПодключитьОбработчикОжидания("ВосстановитьПароль",20,Истина);
	ЗапуститьСистему(СтрокаПараметров);
	 	
КонецПроцедуры
