
&НаКлиенте
Процедура Проверить(Команда)
		
	Если ЭтаФорма.Элементы.ПанельСписков.ТекущаяСтраница = Элементы.ИсходныеСписки Тогда
		
		ТекстСписка1 = ПолеСписка1.ПолучитьТекст();
		ТекстСписка2 = ПолеСписка2.ПолучитьТекст();
		
		ТекстСписка1 = УдалитьПустыеСтроки(ТекстСписка1);
		ТекстСписка2 = УдалитьПустыеСтроки(ТекстСписка2);
				
	Иначе
		
		ТекстСписка1 = ПолеСпискаРезультат1.ПолучитьТекст();
		ТекстСписка2 = ПолеСпискаРезультат2.ПолучитьТекст();
		
	КонецЕсли;
	
	ОчиститьОдинаковыеСтроки(ТекстСписка1,ТекстСписка2);
	
	ТекстСписка1 = УдалитьПустыеСтроки(ТекстСписка1);
	ТекстСписка2 = УдалитьПустыеСтроки(ТекстСписка2);
	
	ПолеСпискаРезультат1.УстановитьТекст(ТекстСписка1);
	ПолеСпискаРезультат2.УстановитьТекст(ТекстСписка2);
	
	КоличествоСтрок = ПолеСпискаРезультат1.КоличествоСтрок();
	Для к = 1 По КоличествоСтрок Цикл
		СтрокаСписка = СокрЛП(ПолеСпискаРезультат1.ПолучитьСтроку(к));
		ИндексСтроки = Найти(ПолеСпискаРезультат2.ПолучитьТекст(), СтрокаСписка);
		Если ИндексСтроки > 0 Тогда
			ПолеСпискаРезультат1.УдалитьСтроку(к);
			ПолеСпискаРезультат2.УдалитьСтроку(ИндексСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ПанельСписков.ТекущаяСтраница = Элементы.РазличияВСписках;
	ОбновитьИИнформационныеНадписи();

КонецПроцедуры


&НаКлиенте
Процедура Поменять(Команда)
	
	Если ЭтаФорма.Элементы.ПанельСписков.ТекущаяСтраница = Элементы.ИсходныеСписки Тогда
		
		ТекстСписка1 = ПолеСписка1.ПолучитьТекст();
		ТекстСписка2 = ПолеСписка2.ПолучитьТекст();
		ПолеСписка1.УстановитьТекст(ТекстСписка2);
		ПолеСписка2.УстановитьТекст(ТекстСписка1);

	Иначе
		
		ТекстСписка1 = ПолеСпискаРезультат1.ПолучитьТекст();
		ТекстСписка2 = ПолеСпискаРезультат2.ПолучитьТекст();
		ПолеСпискаРезультат1.УстановитьТекст(ТекстСписка2);
		ПолеСпискаРезультат2.УстановитьТекст(ТекстСписка1);

	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура Почистить(Команда)
	
	Если ЭтаФорма.Элементы.ПанельСписков.ТекущаяСтраница = Элементы.ИсходныеСписки Тогда
		
		ТекстСписка1 = Пропылесосить(ПолеСписка1.ПолучитьТекст());
		ТекстСписка2 = Пропылесосить(ПолеСписка2.ПолучитьТекст());
		
		ТекстСписка1 = УдалитьПустыеСтроки(ТекстСписка1);
		ТекстСписка2 = УдалитьПустыеСтроки(ТекстСписка2);
		
		//ОчиститьОдинаковыеСтроки(ТекстСписка1,ТекстСписка2);
		
		ПолеСписка1.УстановитьТекст(ТекстСписка1);
		ПолеСписка2.УстановитьТекст(ТекстСписка2);
		
	Иначе
		
		ТекстСписка1 = Пропылесосить(ПолеСпискаРезультат1.ПолучитьТекст());
		ТекстСписка2 = Пропылесосить(ПолеСпискаРезультат2.ПолучитьТекст());
		
		ТекстСписка1 = УдалитьПустыеСтроки(ТекстСписка1);
		ТекстСписка2 = УдалитьПустыеСтроки(ТекстСписка2);
		
		//ОчиститьОдинаковыеСтроки(ТекстСписка1,ТекстСписка2);
		
		ПолеСпискаРезультат1.УстановитьТекст(ТекстСписка1);
		ПолеСпискаРезультат2.УстановитьТекст(ТекстСписка2);
		
	КонецЕсли;
	
	ОбновитьИИнформационныеНадписи();
	
КонецПроцедуры


&НаКлиенте
Функция Пропылесосить(Стр)
	
	Результат = "";
	КоличествоСтрок = СтрЧислоСтрок(Стр);
	Для к = 1 По КоличествоСтрок Цикл
		
		СтрокаСписка = СокрЛП(стрПолучитьСтроку(Стр,к));
		
		НоваяСтрокаЧтоЗаменить = Символы.Таб;
		НоваяСтрокаНаЧтоЗаменить = "";
		СтрокаСписка = СтрЗаменить(СтрокаСписка, НоваяСтрокаЧтоЗаменить, НоваяСтрокаНаЧтоЗаменить);	
		
		НоваяСтрокаЧтоЗаменить = Символы.НПП;
		СтрокаСписка = СтрЗаменить(СтрокаСписка, НоваяСтрокаЧтоЗаменить, НоваяСтрокаНаЧтоЗаменить);
		
		НоваяСтрокаЧтоЗаменить = Символы.ВК;
		СтрокаСписка = СтрЗаменить(СтрокаСписка, НоваяСтрокаЧтоЗаменить, НоваяСтрокаНаЧтоЗаменить);
		
		НоваяСтрокаЧтоЗаменить = Символы.ВТаб;
		СтрокаСписка = СтрЗаменить(СтрокаСписка, НоваяСтрокаЧтоЗаменить, НоваяСтрокаНаЧтоЗаменить);
		
		НоваяСтрокаЧтоЗаменить = Символы.ПФ;
		СтрокаСписка = СтрЗаменить(СтрокаСписка, НоваяСтрокаЧтоЗаменить, НоваяСтрокаНаЧтоЗаменить);
		
		НоваяСтрокаЧтоЗаменить = Символы.ПС;
		СтрокаСписка = СтрЗаменить(СтрокаСписка, НоваяСтрокаЧтоЗаменить, НоваяСтрокаНаЧтоЗаменить);
		
		НоваяСтрокаЧтоЗаменить = "  ";
		НоваяСтрокаНаЧтоЗаменить = " ";
		
		СтрокаСписка = СтрЗаменить(СтрокаСписка, НоваяСтрокаЧтоЗаменить, НоваяСтрокаНаЧтоЗаменить);
		СтрокаСписка = СтрЗаменить(СтрокаСписка, НоваяСтрокаЧтоЗаменить, НоваяСтрокаНаЧтоЗаменить);
		СтрокаСписка = СтрЗаменить(СтрокаСписка, НоваяСтрокаЧтоЗаменить, НоваяСтрокаНаЧтоЗаменить);
		СтрокаСписка = СтрЗаменить(СтрокаСписка, НоваяСтрокаЧтоЗаменить, НоваяСтрокаНаЧтоЗаменить);
		СтрокаСписка = СтрЗаменить(СтрокаСписка, НоваяСтрокаЧтоЗаменить, НоваяСтрокаНаЧтоЗаменить);

		Результат = Результат + СтрокаСписка + Символы.ПС;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция УдалитьПустыеСтроки(стр)
	
	Результат = "";
	КоличествоСтрок = СтрЧислоСтрок(стр);
	Для к = 1 По КоличествоСтрок Цикл
		СтрокаСписка = СокрЛП(стрПолучитьСтроку(стр,к));
		Если НЕ ПустаяСтрока(СтрокаСписка) Тогда
			Результат = Результат + СтрокаСписка + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОчиститьОдинаковыеСтроки(ТекстСписка1,ТекстСписка2)
	
	КоличествоСтрок = СтрЧислоСтрок(ТекстСписка1);
	Для к = 1 По КоличествоСтрок Цикл
		СтрокаСписка = СокрЛП(стрПолучитьСтроку(ТекстСписка1,к));
		Если Найти(ТекстСписка2, СтрокаСписка) > 0 Тогда
			Если СтрЧислоВхождений(ТекстСписка1, СтрокаСписка) = СтрЧислоВхождений(ТекстСписка2, СтрокаСписка) Тогда
				ТекстСписка1 = СтрЗаменить(ТекстСписка1, СтрокаСписка, "");
				ТекстСписка2 = СтрЗаменить(ТекстСписка2, СтрокаСписка, "");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзБуфера1(Команда)
	
	ОбъектБуфер = Новый COMОбъект("htmlfile");
	ПолеСписка1.УстановитьТекст(ОбъектБуфер.ParentWindow.ClipboardData.Getdata("Text"));
	ОбновитьИИнформационныеНадписи();
КонецПроцедуры


&НаКлиенте
Процедура ВставитьИзБуфера2(Команда)
	
	ОбъектБуфер = Новый COMОбъект("htmlfile");
	ПолеСписка2.УстановитьТекст(ОбъектБуфер.ParentWindow.ClipboardData.Getdata("Text"));
    ОбновитьИИнформационныеНадписи();ОбновитьИИнформационныеНадписи();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИИнформационныеНадписи()
	
	Элементы.ПолеСписка1.Заголовок =  "Поле списка1: (" + СтрЧислоСтрок(ПолеСписка1.ПолучитьТекст()) + " строк.)";
	Элементы.ПолеСписка2.Заголовок =  "Поле списка1: (" + СтрЧислоСтрок(ПолеСписка2.ПолучитьТекст()) + " строк.)";
	Элементы.ПолеСпискаРезультат1.Заголовок =  "Поле списка результат1: (" + СтрЧислоСтрок(ПолеСпискаРезультат1.ПолучитьТекст()) + " строк.)";
	Элементы.ПолеСпискаРезультат2.Заголовок =  "Поле списка результат2: (" + СтрЧислоСтрок(ПолеСпискаРезультат2.ПолучитьТекст()) + " строк.)";

КонецПроцедуры
